from bot.misc import Donate

GOD_ID = 1020624735
ADMINS = [1020624735]

# webhook settings
WEBHOOK_HOST = ''
WEBHOOK_PATH = ''
WEBHOOK_URL = f"{WEBHOOK_HOST}{WEBHOOK_PATH}"

# webserver settings
WEBAPP_HOST = '127.0.0.1'  # or ip
WEBAPP_PORT = 4040

array_times = {'check_replacement': {"weekday": ("00:00",
                                                 "00:05",

                                                 "9:00",
                                                 "9:20",
                                                 "9:40",

                                                 "10:00",
                                                 "10:20",
                                                 "10:40",

                                                 "11:00",
                                                 "11:10",
                                                 "11:20",
                                                 "11:30",
                                                 "11:40",
                                                 "11:50",

                                                 "12:00",
                                                 "12:05",
                                                 "12:10",
                                                 "12:15",
                                                 "12:20",
                                                 "12:25",
                                                 "12:30",
                                                 "12:35",
                                                 "12:40",
                                                 "12:45",
                                                 "12:50",
                                                 "12:55",

                                                 "13:00",
                                                 "13:05",
                                                 "13:10",
                                                 "13:15",
                                                 "13:20",
                                                 "13:25",
                                                 "13:30",
                                                 "13:35",
                                                 "13:40",
                                                 "13:45",
                                                 "13:50",
                                                 "13:55",

                                                 "14:00",
                                                 "14:10",
                                                 "14:20",
                                                 "14:30",
                                                 "14:40",
                                                 "14:50",

                                                 "15:00",
                                                 "15:10",
                                                 "15:20",
                                                 "15:30",
                                                 "15:40",
                                                 "15:50",

                                                 "16:00",
                                                 "17:00",

                                                 "23:00",

                                                 "00:00",
                                                 "00:05"),

                                     "saturday": ("00:00",
                                                  "00:05",

                                                  "8:00",
                                                  "8:20",
                                                  "8:40",

                                                  "9:00",
                                                  "9:10",
                                                  "9:20",
                                                  "9:30",
                                                  "9:40",
                                                  "9:50",

                                                  "10:00",
                                                  "10:10",
                                                  "10:20",
                                                  "10:30",
                                                  "10:40",
                                                  "10:50",

                                                  "11:00",
                                                  "11:10",
                                                  "11:20",
                                                  "11:30",
                                                  "11:40",
                                                  "11:50",

                                                  "12:00",
                                                  "13:00",
                                                  "14:00"
                                                  "15:00"
                                                  "16:00"
                                                  "17:00"

                                                  "23:00"

                                                  "00:00",
                                                  "00:05")
                                     }

               }


class AnswerText:
    new_user = {
        "welcome_message_private": lambda user_name: f"Привет {user_name} (^_^)\nЯ бот колледжа ЯПЭК\nДавай определим твой статус 👀",
        "welcome_message_group": lambda user_name: f"Приветствую всех в группе {user_name} (^_^)\nЯ бот колледжа ЯПЭК\nВыберите профиль",
        "choise_type_name": "Выберите профиль",
        "choise_name": lambda type_name: f"Выберите {'группу' if type_name == 'group_' else 'преподавателя'}"
    }

    error = {
        "choise_type_name": "Выберите профиль!",
        "choise_name": "Я не буду реагировать на сообщения до тех пор, пока не будет сделан выбор группы или преподавателя",
        "not_msg_pin": "У бота нет прав на закрепление сообщений",
        "other": "Ошибка!"
    }

    call_schedule = "Расписание звонков\n" \
                    "\n" \
                    "Понедельник - Пятница\n" \
                    "<u>" \
                    "0 |  7:40  |  8:25\n" \
                    "1 |  8:30  | 10:00\n" \
                    "2 | 10:20 | 11:50\n" \
                    "3 | 12:20 | 13:50\n" \
                    "4 | 14:05 | 15:35\n" \
                    "5 | 15:55 | 17:25\n" \
                    "6 | 17:35 | 19:05\n" \
                    "7 | 19:10 | 20:40\n" \
                    "</u>" \
                    "\n" \
                    "Суббота\n" \
                    "<u>" \
                    "1 |  8:30  | 10:00\n" \
                    "2 | 10:10 | 11:40\n" \
                    "3 | 11:55 | 13:25\n" \
                    "4 | 13:35 | 15:05\n" \
                    "</u>"

    message_throttled = "Перестань спамить 😡"
    settings = "🔧 Настройки"
    main_settings = "⚙ Основные настройки"
    no_main_subscription = "Вы не оформили основную подписку \nСделайте это в меню /settings или с помощью команды /start"
    support = "Способы поддержки и связи"
    donate = f"Варианты пожертвования\n" \
             f"\n" \
             f"Bitcoin (BTC):\n" \
             f"<pre>{Donate.BITCOIN}</pre>\n" \
             f"\n" \
             f"Ethereum (ETH):\n" \
             f"<pre>{Donate.ETHERIUM}</pre>\n" \
             f"\n" \
             f"Tether USD (USDT):\n" \
             f"<pre>{Donate.USDT_TRON}</pre>\n" \
             f""

    group__card = "Карточка группы"
    teacher_card = "Карточка преподавателя"
    week_days_main_timetable = "Дни недели"

    help = "Главная функция бота - ежедневная рассылка расписания, а также отслеживание изменений в нём в течение дня\n" \
           "\n" \
           "Вы можете подписаться на конкретные группы в меню /settings и настроить для каждой их них параметр Рассылка 🌀\n" \
           "\n" \
           "В карточке группы можно посмотреть расписание за конкретный день или скачать файл txt, который будет содержать расписание за весь месяц"

    show_keyboard = "Клавиатура добавлена"
    delete_keyboard = "Клавиатура удалена"
    months_history_ready_timetable = "📅 Выберите месяц"
    dates_ready_timetable = lambda name_, month: f"Расписание на <b>{month}</b> месяц для <b>{name_}</b>"

    help_admin = "Список команд для админов\n" \
                 "/delete_user - удалить себя из таблицы\n" \
                 "/get_main_timetable - спарсить основное расписание\n" \
                 "/get_replacement - спарсить замены\n" \
                 "/update_balance - обновить баланс Qiwi\n" \
                 "/update_timetable - спарсить замены и составить по ним готовое расписание\n" \
                 "/info_log - потоковый log\n" \
                 "/error_log - log ошибок\n" \
                 "/mailing {args} - рассылка сообщений для всех пользователей\n" \
                 "/mailing_test - протестировать рассылку\n" \
                 "/set_future_updates - обновить информацию о будущих обновлениях\n" \
                 "/restart_bot - презапустить бота"

    other_messages = ("Извини, но я тебя не понимаю..",
                      "Попробуй посмотреть, что я умею по команде /help",
                      "Мне не нужно писать! У меня есть всего 2 команды:\n"
                      "/settings\n"
                      "/timetable\n"
                      "Используй их)"
                      )


class AnswerCallback:
    new_user = {
        "choise_group__name_finish": lambda name_: f"Вы выбрали группу {name_}",
        "choise_teacher_name_finish": lambda name_: f"Вы выбрали преподавателя {name_}"
    }
    settings_info = {
        "spamming": "Получение ежедневной рассылки расписания",
        "pin_msg": "Закрепление присланного расписания в диалоге (только той группы/преподавателя, для которых оформлена основная подписка)",
        "view_name": "Добавление информации в сообщение о группе/преподавателя, для которых составлено расписание",
        "view_add": "Отображение ФИО преподавателя, ведущего пару, или названия группы",
        "view_time": "Отображать время начала и окончания занятий",
        "subscribe": "Подписка"}
    not_timetable_by_week_day = lambda week_day: f"Расписания на {week_day} нет"
    not_ready_timetable = "Расписание отсутствует"
    not_ready_timetable_by_month = lambda month: f"Расписание на {month} отсутствует"
    spam_or_subscribe_name_id = lambda action_type, result: f"{'Рассылка' if action_type == 'sp' else 'Подписка'} {'активирована' if result else 'удалена'}"

    main_subscribe_name_id = lambda result: f"Основная подписка {'активирована' if result else 'удалена'}"

    error = "Ошибка!"


CALL_SCHEDULE = {"weekday": {
    '0': ('7:40', '8:25'),
    '1': ('8:30', '10:00'),
    '2': ('10:20', '11:50'),
    '3': ('12:20', '13:50'),
    '4': ('14:05', '15:35'),
    '5': ('15:55', '17:25'),
    '6': ('17:35', '19:05'),
    '7': ('19:10', '20:40')
},
    "saturday": {
        '1': ('8:30', '10:00'),
        '2': ('10:10', '11:40'),
        '3': ('11:55', '13:25'),
        '4': ('13:35', '15:05')
    }
}
